app/views/users/index.html.erb

				<div class="downbox new_class">
					<%= user.posts.count %>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 4]]

					<a href="#"> Публикация</a>
					<%= user.followers.count %>
					<a href="#">подписчиков</a>
					<%= user.followed_users.count %>
---
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ?  [["follower_id", 1]]
SELECT "users".* FROM "users"