app/views/users/show.html.erb

		<div class="downbox">
			<%= @user.posts.count %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]

					<%= link_to post_path(post), class: "comment" do %>
						<span><%= post.comments.count %></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]