app/controllers/comments_controller.rb

INSERT INTO "comments" ("description", "user_id", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["description", "asdads asdasdasd"], ["user_id", 1], ["created_at", 2016-09-03 08:28:21 UTC], ["updated_at", 2016-09-03 08:28:21 UTC], ["post_id", 2]]
---
  def create
      @comment = current_user.comments.build(comment_params)
      @comment.save