app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("description", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_file_name", "cpu.jpg"], ["image_file_size", 9526], ["image_updated_at", 2016-09-02 10:15:00 UTC], ["updated_at", 2016-09-02 10:15:00 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)