app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def create
    us_user = User.find(params[:relationship][:followed_id])

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    us_user = Relationship.find(params[:id]).followed