app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "avatar_updated_at" = ?, "updated_at" = ?, "avatar_file_name" = ? WHERE "users"."id" = ?  [["avatar_updated_at", 2016-09-01 12:24:20 UTC], ["updated_at", 2016-09-01 12:24:20 UTC], ["avatar_file_name", "IMG-20160803-WA0004-2.jpg"], ["id", 1]]